InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омГантНастройкаСервер/Ext/Module.bsl
Функция ПолучитьТаблицуСоответсвияГантаКолонки() Экспорт

	ОписаниеСтрока30 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30));
	
	мПрефиксыГанта = ПолучитьПрефиксыГанта();

	тзСоответствиеПрефиксКолонка = Новый ТаблицаЗначений;
	тзСоответствиеПрефиксКолонка.Колонки.Добавить("Префикс", 	ОписаниеСтрока30);
	тзСоответствиеПрефиксКолонка.Колонки.Добавить("ИмяКолонки", ОписаниеСтрока30);
	
	НС = тзСоответствиеПрефиксКолонка.Добавить();
	НС.Префикс 		= мПрефиксыГанта[0];
	НС.ИмяКолонки 	= "Цвет";

	НС = тзСоответствиеПрефиксКолонка.Добавить();
	НС.Префикс 		= мПрефиксыГанта[1];
	НС.ИмяКолонки 	= "ПредставлениеЗначения";

	НС = тзСоответствиеПрефиксКолонка.Добавить();
	НС.Префикс 		= мПрефиксыГанта[2];
	НС.ИмяКолонки 	= "СокращатьНаименование";

	Возврат тзСоответствиеПрефиксКолонка;
	
КонецФункции // ПолучитьТаблицуСоответсвияГантаКолонки()

Функция ПолучитьПрефиксыГанта() Экспорт
	//Порядок не изменять!!!!!!!!
	мПрефиксыГанта = Новый Массив(3);
	мПрефиксыГанта[0] = "ЦветГанта";
	мПрефиксыГанта[2] = "ПредставлениеГанта";
	мПрефиксыГанта[3] = "СокращатьНаименованиеГанта";
	
	Возврат мПрефиксыГанта;
	
КонецФункции // ПолучитьПрефиксыганта() 

Функция НеобходимоеЗначения(ТипДиаграммы = "") Экспорт

		мНужныеЗначения = Новый Массив(12);
		мНужныеЗначения[0] 	= "ТЗ";
		мНужныеЗначения[1] 	= "РКД";
		мНужныеЗначения[2] 	= "ПКД";
		мНужныеЗначения[3] 	= "Производство";
		мНужныеЗначения[4] 	= "Монтаж";
		мНужныеЗначения[5] 	= "Крайняя_дата";
		мНужныеЗначения[6] 	= "Пересечение";
		мНужныеЗначения[7] 	= "Сетка";
		мНужныеЗначения[8] 	= "Проект";
		мНужныеЗначения[9] 	= "Конструктор";
		мНужныеЗначения[10] = "Основное_помещение";
		мНужныеЗначения[11] = "Объект_замера";
	
	Возврат мНужныеЗначения;
	
КонецФункции // НеобходимоеЗначения() ОбъектЗамера

Функция ПолучитьСтруктурыДляЗаполненияДанных() Экспорт
	
	ПустаяДата = Дата(1, 1, 1);
	
	СтруктураВыводЗначения = Новый Структура();
	СтруктураВыводЗначения.Вставить("НомерЭлемента", 				0);
	СтруктураВыводЗначения.Вставить("ПредставлениеЗначения",		"");
	СтруктураВыводЗначения.Вставить("СсылкаНаОбъект", 				Неопределено);
	СтруктураВыводЗначения.Вставить("НомерВидаЭлемента", 			0);
	СтруктураВыводЗначения.Вставить("НомерИнтервалаНачала",			0);
	СтруктураВыводЗначения.Вставить("ПродолжительностьИнтервала",	0);
	СтруктураВыводЗначения.Вставить("ДатаНачала",					ПустаяДата);
	СтруктураВыводЗначения.Вставить("ДатаОкончания",				ПустаяДата);
	
	СтруктураВыводЭлемента = Новый Структура();
	СтруктураВыводЭлемента.Вставить("НомерЭлемента",			0);
	СтруктураВыводЭлемента.Вставить("ПредставлениеЭлемента",	"");
	СтруктураВыводЭлемента.Вставить("РодительЭлемента",			0);
	СтруктураВыводЭлемента.Вставить("СсылкаНаОбъект",			Неопределено);
	СтруктураВыводЭлемента.Вставить("НомерВидаЭлемента",		0);
	СтруктураВыводЭлемента.Вставить("Серия",					"Данные");
	
	СтруктураВидовЗначения = Новый Структура();
	СтруктураВидовЗначения.Вставить("НомерВидаЭлемента",	0);
	СтруктураВидовЗначения.Вставить("ЦветФона",				Новый Цвет(120, 120, 120));
	СтруктураВидовЗначения.Вставить("Представление",		"");
	СтруктураВидовЗначения.Вставить("ПараметрыШрифта",		Новый Структура("РазмерШрифта", 8));
	
	СтруктураНомерИнтервала = Новый Структура();
	СтруктураНомерИнтервала.Вставить("НомерИнтервала", 		0);
	СтруктураНомерИнтервала.Вставить("ДатаНачалаИнтервала", ПустаяДата);
	СтруктураНомерИнтервала.Вставить("Представление", 		"");
	
	Возврат Новый Структура("СтруктураВыводЗначения, СтруктураВыводЭлемента, СтруктураВидовЗначения, СтруктураНомерИнтервала"
						   , СтруктураВыводЗначения, СтруктураВыводЭлемента, СтруктураВидовЗначения, СтруктураНомерИнтервала);

КонецФункции // ПолучитьСтруктурыДляЗаполненияДанных()

Функция ПолучитьСтруктуруПараметров() Экспорт
	
	СтруктураПараметров = Новый Структура("ОписаниеТиповДанных", Неопределено);
	
	Возврат СтруктураПараметров
	
КонецФункции // ПолучитьСтруктуруПараметров()

Функция ПолучитьТаблицыДляДиаграммы(СтруктураПараметров) Экспорт
	
	ОписаниеТиповДанных = Новый ОписаниеТипов(СтруктураПараметров.ОписаниеТиповДанных);
	
	ОписаниеЧисло1	 	= Новый ОписаниеТипов("Число", , ,Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный));
	ОписаниеЧисло6	 	= Новый ОписаниеТипов("Число", , ,Новый КвалификаторыЧисла(6, 0, ДопустимыйЗнак.Неотрицательный));
	ОписаниеСтрока30 	= Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30));
	ОписаниеСтрока10 	= Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10));
	ОписаниеДатаВремя 	= Новый ОписаниеТипов("Дата"	, , , , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	
	тзВыводЗначения = Новый ТаблицаЗначений;
    тзВыводЗначения.Колонки.Добавить("НомерЭлемента",				ОписаниеЧисло6);
    тзВыводЗначения.Колонки.Добавить("ПредставлениеЗначения",		ОписаниеСтрока30);
    тзВыводЗначения.Колонки.Добавить("СсылкаНаОбъект",				ОписаниеТиповДанных);
    тзВыводЗначения.Колонки.Добавить("НомерВидаЭлемента",			ОписаниеЧисло6);
	тзВыводЗначения.Колонки.Добавить("ДатаНачала",					ОписаниеДатаВремя);
	тзВыводЗначения.Колонки.Добавить("ДатаОкончания",				ОписаниеДатаВремя);
	тзВыводЗначения.Колонки.Добавить("НомерИнтервалаНачала",		ОписаниеЧисло6);
	тзВыводЗначения.Колонки.Добавить("ПродолжительностьИнтервала",	ОписаниеЧисло6);
	тзВыводЗначения.Индексы.Добавить("НомерЭлемента");
	
	тзВыводЭлемента = Новый ТаблицаЗначений;
	тзВыводЭлемента.Колонки.Добавить("НомерЭлемента",			ОписаниеЧисло6);
    тзВыводЭлемента.Колонки.Добавить("ПредставлениеЭлемента",	ОписаниеСтрока30);
	тзВыводЭлемента.Колонки.Добавить("РодительЭлемента",		ОписаниеЧисло6);
	тзВыводЭлемента.Колонки.Добавить("СсылкаНаОбъект",			ОписаниеТиповДанных);
	тзВыводЭлемента.Колонки.Добавить("НомерВидаЭлемента",		ОписаниеЧисло6);
	тзВыводЭлемента.Колонки.Добавить("Серия",					ОписаниеСтрока30);
	тзВыводЭлемента.Индексы.Добавить("СсылкаНаОбъект");
	
	тзВидовЭлементов = Новый ТаблицаЗначений; 
	тзВидовЭлементов.Колонки.Добавить("НомерВидаЭлемента",	ОписаниеЧисло6);
	тзВидовЭлементов.Колонки.Добавить("ЦветФона",			Новый ОписаниеТипов("Цвет"));
	тзВидовЭлементов.Колонки.Добавить("Представление",		ОписаниеСтрока30);
	тзВидовЭлементов.Колонки.Добавить("ПараметрыШрифта",	Новый ОписаниеТипов("Структура"));
	тзВидовЭлементов.Индексы.Добавить("НомерВидаЭлемента");
	
	тзНомераИнтервалов = Новый ТаблицаЗначений; 
	тзНомераИнтервалов.Колонки.Добавить("НомерИнтервала",		ОписаниеЧисло6);
	тзНомераИнтервалов.Колонки.Добавить("ДатаНачалаИнтервала",	ОписаниеДатаВремя);
	тзНомераИнтервалов.Колонки.Добавить("Представление",		ОписаниеСтрока10);

	Возврат Новый Структура("тзВыводЗначения, тзВыводЭлемента, тзВидовЭлементов, тзНомераИнтервалов"
							, тзВыводЗначения, тзВыводЭлемента, тзВидовЭлементов, тзНомераИнтервалов);
	

КонецФункции // ПолучитьТаблицыДляДиаграммы()

Функция ЗаполнитьТаблицуДанных(ТаблицаДанных, СтруктураДанных, СтруктураОтбора) Экспорт
	
	
	

КонецФункции // ЗаполнитьТаблицуДанных()
 
Функция ЗаполнитьЦвета(ТипДиаграммы) Экспорт
	мНужныеЗначения = омГантНастройкаСервер.НеобходимоеЗначения(ТипДиаграммы);
	
	мОтбор = Новый Массив;
	
	Для каждого х Из мНужныеЗначения Цикл
		ИмяОбъекта = "%" + х;
		Для каждого префикс Из омГантНастройкаСервер.ПолучитьПрефиксыГанта() Цикл
			мОтбор.Добавить(префикс + ИмяОбъекта);
		КонецЦикла;
	КонецЦикла;
	
	ОписаниеЦелоеЧисло 	= Новый ОписаниеТипов("Число", , ,Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный));
	ОписаниеСтрока50 	= Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));

	тзОбъектыЦвета = Новый ТаблицаЗначений;
	тзОбъектыЦвета.Колонки.Добавить("Значение", 			ОписаниеСтрока50);	
	тзОбъектыЦвета.Колонки.Добавить("ЦветГанта",			Новый ОписаниеТипов("Цвет"));	
	тзОбъектыЦвета.Колонки.Добавить("ПредставлениеГанта", 	ОписаниеСтрока50);	
	тзОбъектыЦвета.Колонки.Добавить("РазмерШрифтаГанта", 	ОписаниеЦелоеЧисло);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки В(&мОтбор)";
	
	Запрос.УстановитьПараметр("мОтбор", мОтбор);
	
	стОтбор = Новый Структура("Значение", );
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЦветПоУмолчанию 				= Новый Цвет(255, 255, 255);
	РазмерШрифтаГантаПоУмолчанию 	= 8;

	Пока Выборка.Следующий() Цикл 
		
		
		мПрефиксОбъект = СтрРазделить(Выборка.ИмяНастройки, "%");
		стОтбор.Значение = мПрефиксОбъект[1];
		НайденыеСтроки = тзОбъектыЦвета.НайтиСтроки(стОтбор);
		
		Если НайденыеСтроки.Количество() = 0 Тогда
			НС = тзОбъектыЦвета.Добавить();
			НС.Значение 				= мПрефиксОбъект[1];
			НС.ЦветГанта 				= ЦветПоУмолчанию;
			НС.ПредставлениеГанта 		= мПрефиксОбъект[1];
			НС.РазмерШрифтаГанта		= РазмерШрифтаГантаПоУмолчанию;
		Иначе
		    НС = НайденыеСтроки[0];
		КонецЕсли;
		
		Если мПрефиксОбъект[0] = "ЦветГанта" Тогда 
			Значение = омЦветНаСервере.ПолучитьЦветИзСтрокиСПрефиксом(Выборка.Значение);	
		Иначе
			Значение = Выборка.Значение;	
		КонецЕсли;
		
		НС[мПрефиксОбъект[0]] = Значение;
	КонецЦикла;
	
	Возврат тзОбъектыЦвета;
КонецФункции // ЗаполнитьЦвета()

Функция ПолучитьТаблицуНастроекГанта() Экспорт
	мОтбор = Новый Массив;
	
	Для каждого х Из омЦветНаСервере.ПолучитьОбъектыДляЦвета() Цикл
		Для каждого текКлюч Из х.Значение Цикл
			мОтбор.Добавить(текКлюч);	
		КонецЦикла;
	КонецЦикла;
	
	ОписаниеЧисло6	 	= Новый ОписаниеТипов("Число", , ,Новый КвалификаторыЧисла(6, 0, ДопустимыйЗнак.Неотрицательный));
	ОписаниеСтрока30 	= Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30));

	ТаблицаЦветов = Новый ТаблицаЗначений;
	ТаблицаЦветов.Колонки.Добавить("Объект", 				ОписаниеСтрока30);
	ТаблицаЦветов.Колонки.Добавить("Цвет", 					Новый ОписаниеТипов("Цвет"));
	ТаблицаЦветов.Колонки.Добавить("РазмерШрифта", 			ОписаниеЧисло6);
	ТаблицаЦветов.Колонки.Добавить("ПредставлениеЗначения", ОписаниеСтрока30);
	ТаблицаЦветов.Колонки.Добавить("СокращатьНаименование", ОписаниеЧисло6);
	ТаблицаЦветов.Индексы.Добавить("Объект");
	
	мИменаОбъектов = НеобходимоеЗначения();
	
	тзСоответствиеПрефиксКолонка = ПолучитьТаблицуСоответсвияГантаКолонки();
	
	стОтбор = Новый Структура("Объект", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИмяНастройки";
	
	
	Запрос.УстановитьПараметр("ИмяНастройки", мОтбор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		мПрефиксОбъект = СтрРазделить(Выборка.ИмяНастройки, "%");
		
		НайденаяСтрока = тзСоответствиеПрефиксКолонка.Найти(мПрефиксОбъект[0], "Префикс"); 
		
		Если НайденаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяКолонки = НайденаяСтрока.ИмяКолонки;
		
		ТекущийОбъект = СтрЗаменить(мПрефиксОбъект[1], "_", " ");
		
		стОтбор.Объект = ТекущийОбъект;
		
		НайденыеСтроки = ТаблицаЦветов.НайтиСтроки(стОтбор);
		
		Если НайденыеСтроки.Количество() = 0 Тогда
			НС = ТаблицаЦветов.Добавить();
			НС.Объект = ТекущийОбъект;
		Иначе
			НС = НайденыеСтроки[0];
		КонецЕсли;
		
		Если ИмяКолонки = "Цвет" Тогда
			Значение = омЦветНаСервере.ПолучитьЦветИзСтрокиСПрефиксом(Выборка.Значение);
		Иначе
			Значение = Выборка.Значение;
		КонецЕсли;
		
		НС[ИмяКолонки] = Значение;
	КонецЦикла;
	
	Возврат ТаблицаЦветов;
КонецФункции // ПолучитьТаблицуНастроекГанта()
